# InverseKilonewtons Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..InverseKilonewtons Property
UnitTypeId Class See Also
---
Inverse kilonewtons.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InverseKilonewtons { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InverseKilonewtons As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InverseKilonewtons {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace